[
  {
    "type": "divider",
    "text": "Rollenspiel: Beauftragung"
  },
  {
    "type": "message",
    "sender": "6",
    "text": "Hallo, wir würden gerne einen Webshop bei ihnen bestellen",
    "timestamp": "9:30"
  },
  {
    "type": "message",
    "sender": "1",
    "text": "Hallo Herr Valls um welches Thema ginge es denn",
    "timestamp": "9:31"
  },
  {
    "type": "message",
    "sender": "6",
    "text": "Ich vertrete ein namhaftes Kunstauktionshaus und möchte sie beauftragen, uns eine exklusive Webpräsenz inklusive eines Onlineauktionshauses zu bauen",
    "timestamp": "9:32"
  },
  {
    "type": "message",
    "sender": "1",
    "text": "Na klar, können wir machen. Bis wann brauchen sie es? Was darf es kosten",
    "timestamp": "9:33"
  },
  {
    "type": "message",
    "sender": "6",
    "text": "Ich bräuchte es bis Juni diesen Jahres und ich habe ein fixes Budget von 50k€",
    "timestamp": "9:34"
  },
  {
    "type": "message",
    "sender": "1",
    "text": "Ok, kein Problem",
    "timestamp": "9:35"
  },

  {
    "type": "message",
    "sender": "1",
    "text": "Du, Hicham, ich habe gerade ein Auftrag bekommen eine Webseite zu bauen",
    "timestamp": "9:35"
  },

  {
    "type": "message",
    "sender": "2",
    "text": "Ok, kein Problem",
    "timestamp": "9:36"
  },
  {
    "type": "message",
    "sender": "1",
    "text": "... inklusive eines Auktionshauses, können wir sowas?",
    "timestamp": "9:35"
  },
  {
    "type": "message",
    "sender": "2",
    "text": "Öhm, haben wir noch nie gemacht. Du solltest vorher vielleicht mal fragen bevor du etwas anbietest",
    "timestamp": "9:36"
  },
  {
    "type": "message",
    "sender": "1",
    "text": "Jaja, mach ich nächstes mal, versprochen",
    "timestamp": "9:35"
  },
  {
    "type": "message",
    "sender": "2",
    "text": "Was ist unser Budget?",
    "timestamp": "9:36"
  },
  { "type": "message", "sender": "1", "text": "50k, fix", "timestamp": "9:35" },
  {
    "type": "message",
    "sender": "2",
    "text": "Waaas?? Dann kann ich ja nur 3 Coder ansetzen damit auch was übrig bleibt... Ok ich sag ihnen Bescheid",
    "timestamp": "9:36"
  },
  {
    "type": "message",
    "sender": "2",
    "text": "Jan, Dirk, Micha, ihr baut jetzt mal eine Website mit nem Auktionshaus, einer Kümmert sich um die Website, einer um die Auktionsseite und einer macht sich schlau wie das mit Sicherheit aussieht",
    "timestamp": "9:36"
  },
  { "type": "message", "sender": "4", "text": "Ok", "timestamp": "9:36" },
  { "type": "message", "sender": "3", "text": "Ok", "timestamp": "9:36" },
  {
    "type": "message",
    "sender": "5",
    "text": "Wenns sein muss",
    "timestamp": "9:36"
  },
  {
    "type": "message",
    "sender": "3",
    "text": "Müssen wir DSGVO beachten?",
    "timestamp": "9:36"
  },
  {
    "type": "message",
    "sender": "5",
    "text": "Was für Daten sollen denn gespeichert werden?",
    "timestamp": "9:36"
  },
  {
    "type": "message",
    "sender": "4",
    "text": "Machen wir auch die Wartung?",
    "timestamp": "9:36"
  },
  {
    "type": "message",
    "sender": "2",
    "text": "ja, ist alles noch nicht abschließend geklärt, ich regel das Zeitnah mit der Chefin, aber fangt schonmal an",
    "timestamp": "9:36"
  },
  {
    "type": "divider",
    "text": "Rollenspiel: Kosten der Sicherheit"
  },
  {
    "type": "message",
    "sender": "1",
    "text": "Hallo Herr Valls, ich hätte da noch einmal ein Thema bezüglich ihres Auftrages",
    "timestamp": "9:42"
  },
  {
    "type": "message",
    "sender": "6",
    "text": "Ah um was geht's? Wollen sie etwa jetzt schon nachverhandeln?",
    "timestamp": "9:43"
  },
  {
    "type": "message",
    "sender": "1",
    "text": "Nein, aber wir müssten uns über das Thema Sicherheit unterhalten ...",
    "timestamp": "9:44"
  },
  {
    "type": "message",
    "sender": "6",
    "text": "Wieso dass denn? Können sie das nicht sicher machen?",
    "timestamp": "9:44"
  },
  {
    "type": "message",
    "sender": "1",
    "text": "Ja, schon aber Sicherheit ist ja bekanntlich kein zustand, sondern ein Prozess...",
    "timestamp": "9:45"
  },
  {
    "type": "message",
    "sender": "6",
    "text": "Das heißt?",
    "timestamp": "9:45"
  },
  {
    "type": "message",
    "sender": "1",
    "text": "Wir müssten die Sicherheit schon ganzheitlich betrachten, von der Softwareentwicklung bis zum Betrieb.",
    "timestamp": "9:46"
  },
  {
    "type": "message",
    "sender": "6",
    "text": "Ach ja, Betrieb, da müssen wir gegebenen Falls auch noch mal drüber sprechen, ich habe da ja nicht so die Expertise",
    "timestamp": "9:47"
  },
  {
    "type": "message",
    "sender": "1",
    "text": "Wir können das gerne für sie Betreiben, dass würde aber extra Berechnet werden",
    "timestamp": "9:48"
  },
  {
    "type": "message",
    "sender": "6",
    "text": "Und wie viel soll das Kosten und was machen sie dann genau?",
    "timestamp": "9:49"
  },
  {
    "type": "message",
    "sender": "1",
    "text": "Wir würden die für Sie entwickelte Anwendung dann bei uns im Rechenzentrum hosten und uns natürlich auch um die Sicherheit kümmern",
    "timestamp": "9:49"
  },
  {
    "type": "message",
    "sender": "6",
    "text": "Und das Kostet?",
    "timestamp": "9:50"
  },
  {
    "type": "message",
    "sender": "1",
    "text": "Bei ihrem zu erwartenden Volumen und Anforderungen würde ich von ca 200€ im Monat ausgehen, wenn sie länger buchen dann könnte man sicher auch noch einmal über den Preis reden",
    "timestamp": "9:51"
  },
  {
    "type": "message",
    "sender": "6",
    "text": "2500€? Für das bisschen? Ich sag dem Azubi der soll das machen, der hat ja schließlich auch so ein Smartphone",
    "timestamp": "9:52"
  },
  {
    "type": "message",
    "sender": "1",
    "text": "Das steht ihnen natürlich frei... Aber sie müssen Bedenken was das auch unter anderem für rechtliche Konsequenzen haben kann...",
    "timestamp": "9:52"
  },
  {
    "type": "message",
    "sender": "6",
    "text": "Rechtliche?",
    "timestamp": "9:53"
  },
  {
    "type": "message",
    "sender": "1",
    "text": "Nun, sie wollen Kundendaten verarbeiten, Bankverbindungen, Onlinezahlung, da kommt schon was zusammen, DSGVO und so. Sie wissen schon...",
    "timestamp": "9:53"
  },
  {
    "type": "message",
    "sender": "6",
    "text": "Hmm... ich werde das noch mal mit unserer IT Besprechen ... Mal schauen wo der Azubi schon wieder steckt ...",
    "timestamp": "9:54"
  },
  {
    "type": "divider",
    "text": "Rollenspiel: Kosten der Sicherheit (Überarbeitet)"
  },
  {
    "type": "divider",
    "text": "[...vorheriger Chat]"
  },
  {
    "type": "message",
    "sender": "1",
    "text": "Sie sollten auch im Blick behalten, dass Software stets aktuell gehalten werden muss. Anforderungen und Risiken entwickeln sich ebenfalls stetig weiter, so dass ein Produkt, dass mit heutigem Stand sicher ist, bereits morgen Gaunern Tür und Tor offen stehen lässt.",
    "timestamp": "9:55"
  },
  {
    "type": "message",
    "sender": "6",
    "text": "Da spielt unsere IT sicher einfach einen Patch auf und die Sache ist wieder sicher...",
    "timestamp": "9:55"
  },
  {
    "type": "message",
    "sender": "1",
    "text": "Sollten wir den Betrieb übernehmen, warten wir die Software für Sie, so dass sie stehts ein Produkt haben, dass auf dem neusten Stand der Technik und vorallem allen Kriterien von guter Software genügt!",
    "timestamp": "9:56"
  },
  {
    "type": "message",
    "sender": "6",
    "text": "Ihre Argumente hören sich ganz vernünftig an, jedoch reden wir auch über viel Geld, ich lasse es mir nochmal durch den Kopf gehen...",
    "timestamp": "9:58"
  },
  {
    "type": "divider",
    "text": "Rollenspiel: Bedrohungsmodellierung, Unternehmen"
  },
  {
    "type": "divider",
    "text": "[...vorheriger Chat]"
  },
{
  "type": "message",
  "sender": "1",
  "text": "Guten Tag, Herr Valls. Vielen Dank für Ihre Zeit. Ich möchte betonen, dass die Sicherheitsaspekte, die wir besprechen werden, für den Erfolg unseres Web-Auktionshauses von entscheidender Bedeutung sind. Unsere Unternehmenswerte, die Anwenderanforderungen und der Schutz vor potenziellen Angreifern stehen im Mittelpunkt unseres Sicherheitsmanagements.",
  "timestamp": "9:31"
},
{
  "type": "message",
  "sender": "6",
  "text": "Guten Tag, Frau Kuczera, ich erinnere mich daran, dass die Sicherheitsaspekte bereits erwähnt wurden. Ich bin gespannt darauf, wie Sie sicherstellen wollen, dass sie erfüllt werden.",
  "timestamp": "9:31"
},
{
  "type": "message",
  "sender": "1",
  "text": "Richtig, die Sicherheitsaspekte sind von größter Bedeutung für uns. Unser Unternehmen hat ein umfassendes Sicherheitsmanagement etabliert, das auf bewährten Standards und Best Practices basiert. Wir setzen moderne Verschlüsselungstechnologien ein, um die Vertraulichkeit und Integrität sensibler Daten, wie Zahlungsinformationen und persönliche Nutzerdaten, zu gewährleisten. Zusätzlich implementieren wir Firewalls, Intrusion-Detection-Systeme und führen regelmäßige Sicherheitsaudits durch, um potenzielle Angriffe zu erkennen und abzuwehren.",
  "timestamp": "9:31"
},
{
  "type": "message",
  "sender": "6",
  "text": "Das klingt beruhigend. Sicherheit ist für uns von größter Bedeutung, da wir das Vertrauen unserer Kunden wahren müssen. Wie gewährleisten Sie die Einhaltung von Sicherheitsstandards und die Abwehr von Angriffen?",
  "timestamp": "9:31"
},
{
  "type": "message",
  "sender": "1",
  "text": "Unsere Sicherheitsmaßnahmen basieren auf anerkannten Standards wie ISO 27001 und befolgen bewährte Vorgehensweisen in Bezug auf Sicherheitsmanagement. Wir haben ein engagiertes Team von Sicherheitsexperten, das kontinuierlich die neuesten Bedrohungen und Angriffsmethoden analysiert und entsprechende Gegenmaßnahmen implementiert. Zudem sorgen wir dafür, dass unsere Mitarbeiter regelmäßig geschult werden, um Sicherheitsbewusstsein und -verhalten zu fördern.", 
  "timestamp": "9:31"
},
{
  "type": "message",
  "sender": "6",
  "text": "Das klingt vielversprechend. Ich schätze Ihre klare Haltung zu den sicherheitsrelevanten Aspekten. Wir werden Ihre Vorschläge sorgfältig prüfen und uns weiter darüber austauschen.",
  "timestamp": "9:31"
},
{
  "type": "divider",
  "text": "Rollenspiel: Kosten der Sicherheit"
},
{
  "type": "message",
  "sender": "1",
  "text": "Guten Morgen Team, ich habe eine Idee, wie wir die Sicherheit unseres Projekts weiter verbessern können.",
  "timestamp": "9:00"
},
{
  "type": "message",
  "sender": "3",
  "text": "Was schlägst du vor, Christine?",
  "timestamp": "9:01"
},
{
  "type": "message",
  "sender": "1",
  "text": "Ich denke, wir sollten unabhängige Dritte einbeziehen, um unseren Code und unsere Sicherheitsmaßnahmen zu überprüfen. Das würde eine zusätzliche Ebene der Sicherheit bieten.",
  "timestamp": "9:02"
},
{
  "type": "message",
  "sender": "4",
  "text": "Das klingt vernünftig, aber bedeutet das nicht, dass wir unsere eigenen Tests vernachlässigen können?",
  "timestamp": "9:03"
},
{
  "type": "message",
  "sender": "1",
  "text": "Nein, auf keinen Fall. Unsere eigenen Tests bleiben weiterhin wichtig, aber die Einbeziehung unabhängiger Dritter gibt uns zusätzliche Gewissheit und Objektivität.",
  "timestamp": "9:04"
},
{
  "type": "message",
  "sender": "2",
  "text": "Das klingt nach einer guten Maßnahme, aber wie hoch sind die Kosten dafür? Wir müssen das Budget im Auge behalten.",
  "timestamp": "9:05"
},
{
  "type": "message",
  "sender": "1",
  "text": "Das ist ein wichtiger Punkt, Hicham. Die Kosten hängen von verschiedenen Faktoren ab, wie dem Umfang der Prüfung und den gewählten unabhängigen Dritten. Ich werde weitere Informationen einholen, um eine bessere Kosteneinschätzung zu geben.",
  "timestamp": "9:06"
},
{
  "type": "message",
  "sender": "3",
  "text": "Können wir uns diese zusätzliche Maßnahme überhaupt leisten? Wir haben bereits ein begrenztes Budget.",
  "timestamp": "9:07"
},
{
  "type": "message",
  "sender": "1",
  "text": "Ich verstehe deine Bedenken, Dirk. Die Sicherheit ist jedoch von großer Bedeutung, insbesondere wenn es um den Schutz unserer Nutzerdaten geht. Als Entwicklungsleitung trage ich die Verantwortung für die Sicherheit des Projekts und bin optimistisch, dass wir einen Weg finden, um die zusätzlichen Kosten zu bewältigen.",
  "timestamp": "9:08"
},
{
  "type": "message",
  "sender": "4",
  "text": "Als Entwickler sehe ich auch die Bedeutung der Sicherheit, aber wir müssen auch das Budget im Blick behalten. Gibt es Möglichkeiten, die Kosten zu optimieren?",
  "timestamp": "9:09"
},
{
  "type": "message",
  "sender": "1",
  "text": "Das ist ein interessanter Vorschlag, Jan. Ich werde prüfen, ob wir eine solche selektive Überprüfung in Betracht ziehen können, um die Kosten zu optimieren, ohne die Sicherheit zu beeinträchtigen.",
  "timestamp": "9:10"
},
{
  "type": "message",
  "sender": "2",
  "text": "Es ist wichtig, dass wir die Sicherheit ernst nehmen, aber wir müssen auch das Budget im Blick behalten. Lass uns eine fundierte Entscheidung treffen.",
  "timestamp": "9:11"
},
{
  "type": "message",
  "sender": "1",
  "text": "Absolut, Hicham. Als Entwicklungsleitung trage ich die Verantwortung für das Gesamtprojekt, einschließlich der Sicherheit. Während Entwickler oft optimistisch sein können, da sie eng mit dem Code arbeiten, ist es meine Aufgabe, die Risiken abzuwägen und sicherzustellen, dass wir angemessene Sicherheitsmaßnahmen ergreifen.",
  "timestamp": "9:12"
},
{
  "type": "message",
  "sender": "4",
  "text": "Verstehe. Ich schätze deine Bemühungen, Christine, und ich bin bereit, bei der Umsetzung der zusätzlichen Sicherheitsmaßnahmen zu unterstützen.",
  "timestamp": "9:13"
},
{
  "type": "message",
  "sender": "1",
  "text": "Vielen Dank, Jan. Es ist großartig zu wissen, dass das Team zusammenarbeitet, um die Sicherheit unseres Projekts zu verbessern. Ich werde die Kosteneinschätzung vorbereiten und wir werden gemeinsam die beste Vorgehensweise finden.",
  "timestamp": "9:14"
}]